clear
clc

%产生给定方差的高斯白噪声
N=3000;
seta=0.0332;
y=randn(1,N)*sqrt(seta);  % noise sig 

%AR模型u1(n-1)的参数
a1=-1.6;              
a2=1.46;
a3=-0.616;
a4=0.1525;

%根据AR模型产生u（n）序列
N=3000;
u1=zeros(1,N);        %初始化u1（n）n时刻输入信号的向量
for i=1:N-4
    u1(i+4)=-a1*u1(i+3)-a2*u1(i+2)-a3*u1(i+1)-a4*u1(i)+y(i+4);   %产生序列u（n）---z(n)观测向量
end

%卡尔曼滤波
e=0.005;        %设定观测噪声方差
N=2000;
for i=5:N
    U(:,i)=[u1(i-1); u1(i-2) ;u1(i-3); u1(i-4)];  %构成观测矩阵c(n)'          前期准备
end
P=eye(4);  %状态误差自相关矩阵 初始E矩阵
W=zeros(4,N);   %最优权值  状态向量x(n)初始化   1
for i=1:2000    
    P_pre=P; %预测状态误差自相关矩阵 3
    A=(U(:,i))'*P_pre*U(:,i)+e;  %新息过程自相关矩阵 4
    K=P_pre*U(:,i)/A;  %卡尔曼增益 5
    alpha(i)=u1(i)-(U(:,i))'*W(:,i); %由观测信号计算新息过程 2
    W(:,i+1)=W(:,i)+K*alpha(i);  %状态估计 6
    P=P_pre-K*(U(:,i))'*P_pre;  %状态估计误差自相关矩阵 7
end
 t = 1:1000;
 plot(t,W(1,t),'b',t,W(2,t),'r',t,W(3,t),'y',t,W(4,t),'g'); %红色线最优化估算结果滤波后的值，绿色线观测值，蓝色线预测值
hold off;
xlabel('迭代次数');
ylabel('权值');
title('计算权值');
b=W(1,600)
r=W(2,600)
y=W(3,600)
g=W(4,600)
%原参数 b=1.6;
%       r=-1.46;
%       y=0.616;
%       g=-0.1525;
